{
  "revelation": {
    "title": "Estudo do Livro de Apocalipse",
    "subtitle": "Uma Jornada Capítulo por Capítulo, Versículo por Versículo",
    "description": "Mergulhe profundamente nas visões proféticas de João e descubra as verdades profundas da revelação final de Cristo à humanidade.",
    "navigation": {
      "totalChapters": "22 Capítulos",
      "studyProgress": "Progresso do Estudo",
      "startStudy": "Iniciar Estudo",
      "continueStudy": "Continuar Estudo",
      "chapterOverview": "Visão Geral do Capítulo",
      "verseStudy": "Estudo do Versículo",
      "keyThemes": "Temas Principais",
      "practicalApplication": "Aplicação Prática",
      "previousChapter": "Capítulo Anterior",
      "nextChapter": "Próximo Capítulo",
      "backToOverview": "Voltar à Visão Geral"
    },
    "chapters": {
      "1": {
        "title": "A Revelação de Jesus Cristo",
        "subtitle": "Comentário Exegético e Devocional",
        "summary": "João recebe a revelação divina e vê Cristo glorificado no meio dos candeeiros de ouro",
        "keyVerses": ["1:1", "1:7", "1:17-18"],
        "themes": [
          "Revelação Divina",
          "Autoridade de Cristo", 
          "Testemunho Fiel",
          "Segunda Vinda",
          "Cristo no Meio das Igrejas"
        ],
        "epigraph": "As visões deste livro são apresentadas como um 'desvelar de verdades ocultas', uma revelação da soberania de Deus sobre o futuro, mostrando como Ele trará o fim do aparente sucesso das forças do mal neste mundo (Osborne, 2002).",
        "sections": {
          "1": {
            "title": "Prólogo: A Corrente da Revelação (1:1-3)",
            "content": "O Apocalipse abre com uma declaração de origem e propósito: 'Revelação de Jesus Cristo, que Deus lhe deu para mostrar aos seus servos as coisas que em breve devem acontecer...' (1:1). Aqui, 'revelação' (ἀποκάλυψις, apokalypsis) significa literalmente 'tirar o véu', destacar aquilo que estava oculto e agora é explicitado (Stefanovic, 2009, 53-54).",
            "keyPoints": [
              "O termo 'revelação' aparece 18 vezes no Novo Testamento",
              "Indica sempre um ato divino de revelação",
              "É mais que uma profecia sobre o fim - é revelação do próprio Jesus",
              "Muitos consideram o 'Quinto Evangelho' onde todas as promessas convergem"
            ],
            "greekTerms": [
              {
                "term": "ἀποκάλυψις (apokalypsis)",
                "meaning": "tirar o véu, revelação"
              },
              {
                "term": "σημαίνω (sēmainō)", 
                "meaning": "dar a conhecer por meio de sinais e símbolos"
              },
              {
                "term": "δοῦλος (doulos)",
                "meaning": "servos, escravos - toda a comunidade da fé"
              }
            ],
            "theologicalInsights": [
              "O caminho da revelação é quadripartido: Deus → Jesus → anjo → João → igrejas",
              "O livro é repleto de linguagem figurada como os profetas do AT",
              "As 'coisas que em breve devem acontecer' ecoam Daniel 2:28-30",
              "O tempo do fim começou com a obra de Cristo"
            ]
          },
          "2": {
            "title": "Testemunha Ocular: Palavra e Testemunho (1:2)",
            "content": "João se apresenta como aquele que 'atestou a palavra de Deus e o testemunho de Jesus Cristo, quanto a tudo o que viu.' O termo 'testemunho' (μαρτυρία, martyria) remete à missão profética e ao compromisso com a verdade revelada, mesmo diante da perseguição.",
            "keyPoints": [
              "João assume postura de mensageiro fiel como os antigos profetas",
              "O 'testemunho de Jesus' é a essência do espírito profético (19:10)",
              "A 'palavra de Deus' ecoa Gênesis 1 e João 1",
              "A revelação é criadora e recriadora"
            ],
            "greekTerms": [
              {
                "term": "μαρτυρία (martyria)",
                "meaning": "testemunho, especialmente diante da perseguição"
              }
            ]
          },
          "3": {
            "title": "Bem-Aventurança do Leitor (1:3)",
            "content": "'Bem-aventurados aqueles que leem e aqueles que ouvem as palavras da profecia e guardam as coisas nela escritas, pois o tempo está próximo.' O Apocalipse inicia com a primeira de sete bem-aventuranças, colocando em destaque o valor da leitura, audição e prática da mensagem.",
            "keyPoints": [
              "Primeira de sete bem-aventuranças do Apocalipse",
              "Não basta ler superficialmente - é necessário ouvir e obedecer",
              "'Guardar' é verbo recorrente - indica compromisso com a vontade de Deus",
              "A bênção é para quem persevera em fidelidade"
            ],
            "practicalApplication": "O ponto não é especulação sobre o tempo, mas prontidão e fidelidade. Permita que o texto molde sua vida através da leitura atenta, audição cuidadosa e obediência prática."
          },
          "4": {
            "title": "Saudação Trinitária e Doxologia (1:4-6)",
            "content": "O destinatário imediato são 'as sete igrejas que se encontram na Ásia', representando a totalidade do povo de Deus de todos os tempos. 'Graça e paz' vêm do Deus eterno, dos 'sete Espíritos' (Espírito Santo em plenitude) e de Jesus Cristo.",
            "keyPoints": [
              "Sete igrejas representam a totalidade do povo de Deus",
              "Tríplice saudação destaca o agir soberano da Trindade",
              "Cristo apresentado em três títulos fundamentais",
              "Libertação é tanto perdão quanto transformação"
            ],
            "christTitles": [
              {
                "title": "Fiel Testemunha",
                "meaning": "Cumpriu sua missão até a morte"
              },
              {
                "title": "Primogênito dos Mortos", 
                "meaning": "Pioneiro da ressurreição"
              },
              {
                "title": "Soberano dos Reis da Terra",
                "meaning": "Senhor da história e dos poderes humanos"
              }
            ],
            "doxology": "Cristo 'nos ama e, pelo seu sangue, nos libertou dos nossos pecados' e fez de Seu povo 'reino e sacerdotes' (Êx 19:6), chamados ao serviço e testemunho, não à dominação."
          },
          "5": {
            "title": "Anúncio Escatológico (1:7-8)",
            "content": "'Eis que vem com as nuvens, e todo olho o verá...' (Dn 7:13; Mt 26:64). O retorno de Cristo será universal, visível e transformador, revertendo toda injustiça e rejeição. Até mesmo 'os que o traspassaram' experimentarão a revelação e lamento.",
            "keyPoints": [
              "O retorno será universal, visível e transformador",
              "Inversão dramática das relações históricas",
              "Deus é soberano sobre toda a história",
              "Ele é o início e o fim, Senhor do tempo e destino"
            ],
            "crossReferences": ["Dn 7:13", "Mt 26:64", "Zac 12:10", "Jo 19:37"],
            "alphaOmega": "'Eu sou o Alfa e Ômega...' (1:8) enfatiza a soberania absoluta de Deus sobre toda a história. Ele é capaz de cumprir todas as Suas promessas."
          },
          "6": {
            "title": "Cristo no Meio dos Candeeiros de Ouro (1:9-20)",
            "content": "João se identifica com seus leitores como 'irmão e companheiro na tribulação, no reino e na perseverança'. O caminho do discípulo é marcado por resistência, fidelidade e esperança em meio às adversidades. Patmos, ilha de exílio, torna-se o palco da revelação.",
            "setting": {
              "place": "Patmos, ilha de exílio",
              "time": "No dia do Senhor",
              "experience": "Arrebatado em espírito",
              "sound": "Voz como trombeta - linguagem de teofania"
            },
            "vision": {
              "location": "Cristo caminhando no meio dos candeeiros de ouro (as igrejas)",
              "identity": "Filho do Homem (Dn 7:13; 10:5-6)",
              "role": "Sumo Sacerdote e Rei, supervisionando sua igreja"
            },
            "christDescription": [
              {
                "feature": "Cabeça e cabelos brancos",
                "meaning": "Imagem do 'Ancião de Dias' (Dn 7:9), unificando Pai e Filho",
                "reference": "Dn 7:9"
              },
              {
                "feature": "Olhos como chama de fogo", 
                "meaning": "Penetração e julgamento",
                "reference": "Dn 10:6"
              },
              {
                "feature": "Pés de bronze polido",
                "meaning": "Firmeza, pureza e vitória sobre o mal",
                "reference": "Dn 3"
              },
              {
                "feature": "Voz como de muitas águas",
                "meaning": "Majestade e poder divinos",
                "reference": "Ez 1:24"
              },
              {
                "feature": "Sete estrelas na mão direita",
                "meaning": "Autoridade sobre os anjos das igrejas", 
                "reference": "Dn 12:1-7"
              },
              {
                "feature": "Espada afiada de dois gumes",
                "meaning": "A Palavra divina, que julga e liberta",
                "reference": "Is 11:4; 49:2; Heb 4:12"
              },
              {
                "feature": "Rosto brilhante como o sol",
                "meaning": "Glória divina, vitória messiânica",
                "reference": "Jz 5:31; Mt 17:2"
              }
            ],
            "response": "Diante desta visão, João cai como morto, mas Cristo o ergue: 'Não temas; eu sou o primeiro e o último', expressão de Isaías agora atribuída ao próprio Cristo, reafirmando Sua divindade e soberania.",
            "authority": "Cristo declara possuir 'as chaves da morte e do inferno', autoridade total sobre o destino humano. O mistério das sete estrelas e candeeiros é revelado: Cristo reina mesmo em meio ao sofrimento de Sua igreja."
          }
        },
        "verses": {
          "1": {
            "text": "Revelação de Jesus Cristo, que Deus lhe deu para mostrar aos seus servos as coisas que em breve devem acontecer e que ele, enviando por intermédio do seu anjo, notificou ao seu servo João,",
            "commentary": "Este versículo de abertura estabelece a origem divina e o propósito de todo o livro. A palavra 'revelação' (apokalypsis) significa 'desvelamento' ou 'revelação.' O caminho da revelação é quadripartido: Deus → Jesus → anjo → João → igrejas.",
            "keyPoints": [
              "Origem divina - de Jesus Cristo",
              "Propósito - mostrar eventos futuros aos servos",
              "Método - através de mensageiro angelical",
              "Destino - comunidade da fé (servos)"
            ],
            "application": "Deus deseja revelar Seus planos ao Seu povo. Devemos abordar este livro com reverência e expectativa, reconhecendo sua origem divina.",
            "greekNotes": "ἀποκάλυψις (apokalypsis) - tirar o véu, revelação; σημαίνω (sēmainō) - dar a conhecer por sinais",
            "crossReferences": ["Lc 2:32", "Rm 16:25", "Dn 2:28-30"]
          },
          "2": {
            "text": "o qual atestou a palavra de Deus e o testemunho de Jesus Cristo, quanto a tudo o que viu.",
            "commentary": "João serve como uma testemunha fiel, enfatizando a confiabilidade do que ele registra. O 'testemunho de Jesus' é identificado como a essência do espírito profético.",
            "keyPoints": [
              "João como testemunha fiel e ocular",
              "Autoridade da Palavra de Deus confirmada",
              "Testemunho de Jesus Cristo como centro",
              "Compromisso com a verdade revelada"
            ],
            "application": "Nós também somos chamados a ser testemunhas fiéis do que Deus nos revelou, mantendo compromisso com a verdade mesmo diante das dificuldades.",
            "greekNotes": "μαρτυρία (martyria) - testemunho, especialmente diante da perseguição",
            "crossReferences": ["Jo 19:35", "1Jo 1:1-3", "Jo 21:24", "Ap 19:10"]
          },
          "3": {
            "text": "Bem-aventurados aqueles que leem e aqueles que ouvem as palavras da profecia e guardam as coisas nela escritas, pois o tempo está próximo.",
            "commentary": "A primeira de sete bem-aventuranças do Apocalipse enfatiza não apenas a leitura, mas a audição atenta e a prática obediente da mensagem revelada.",
            "keyPoints": [
              "Primeira bem-aventurança de sete no Apocalipse",
              "Tríplice ação: ler, ouvir e guardar",
              "'Guardar' indica compromisso prático",
              "Urgência escatológica: 'o tempo está próximo'"
            ],
            "application": "A bênção vem através do engajamento ativo com a Palavra: leitura cuidadosa, audição atenta e obediência prática que transforma a vida.",
            "crossReferences": ["Ap 22:7", "Lc 11:28", "Tg 1:22-25"]
          }
        },
        "patristic": "Vários pais da igreja, como Justino Mártir, Irineu, Tertuliano e Clemente de Alexandria, confirmaram a autoria joanina e interpretaram Apocalipse 1 como revelação messiânica e escatológica, centrada na soberania de Cristo.",
        "conclusion": "O primeiro capítulo do Apocalipse apresenta Jesus Cristo como o centro da história e da esperança cristã. Ele é o revelador, o redentor, o juiz e o soberano, que caminha em meio à Sua igreja, fortalecendo, corrigindo e guiando. A mensagem é clara: não há poder na história que escape ao domínio de Cristo.",
        "references": [
          "Beale, G. K., The Book of Revelation, Eerdmans, 1998",
          "Beale, G. K., Revelation: A Shorter Commentary, Eerdmans, 2015", 
          "Tonstad, S. K., Revelation (Paideia), Baker Academic, 2019",
          "Osborne, G. R., Revelation (Baker Exegetical Commentary), Baker Academic, 2002",
          "Stefanovic, R., Revelation of Jesus Christ (2nd Edition), Andrews University Press, 2009"
        ]
      }
    }
  }
}
